title: Windows Office Suspicious Dll Load
status: experimental
description: Detects suspicious WMI and Task Scheduler DLL loads from MS Office processes
author: magnitfan
references:
    - https://twitter.com/SBousseaden/status/1161919993652662273
date: 2019/11/06
tags:
    - attack.execution
    - attack.persistence
    - attack.defense_evasion
    - attack.t1047
    - attack.t1122
logsource:
    product: windows
    service: sysmon
detection:
    selection:
        EventID: 7
        Image:
            - '*\WINWORD.EXE'
            - '*\EXCEL.EXE'
            - '*\POWERPNT.EXE'
            - '*\OUTLOOK.EXE'
        ImageLoaded:
            - '*\wmiutils.dll'
            - '*\taskschd.dll'
            - '*\wbemcomn.dll'
            - '*\wbemprox.dll'
            - '*\wbemdisp.dll'
            - '*\wbemsvc.dll'
    condition: selection
falsepositives:
    - Unknown
level: low
